[
  {
    "id": "scraped-0",
    "quote": "My stay at Karuna Villa was absolutely wonderful , one of the best parts was that all the major visiting sites were nearby, making it super easy to explore . I highly recommend staying here , you’ll feel welcomed, relaxed, and well taken care of. Thank you Preeti, for being such an amazing host. Looking forward to coming back soon!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/8538429f-e3d4-4cde-a440-16685b7bb752.jpeg?im_w=240",
    "name": "Siddhant",
    "location": "Airhe, India"
  },
  {
    "id": "scraped-1",
    "quote": "Preeti's place was v nice, meticulous , clean, peaceful, surrounded by greenery. Caretaker Mangal was v helpful even at odd hrs like 3am. Owner Ms Preeti was just a call away. It was v near to d conference venue Deendayal hastkala sankul and so was v convenient though far from Vishwanath temple and old city. Overall stay was good.",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/77b6a953-f233-4dda-8df9-4f65deb13dbe.jpeg?im_w=240",
    "name": "Madhumita",
    "location": "Mumbai, India"
  },
  {
    "id": "scraped-2",
    "quote": "We had a pleasant stay at this place. The caretaker was very active in solving any issues. The bathroom was clean.\nDeendayal Hasthkala Sankul is nearby, walking distance. The stay was well lit by sunlight. Will definitely visit and stay again when I visit Varanasi. Thank you for making our stay memorable.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/c9167fbf-7dc8-4d39-91ab-b8b5d529ac7b.jpg?im_w=240",
    "name": "Rupraj",
    "location": "India"
  },
  {
    "id": "scraped-3",
    "quote": "We had a great stay at this property. The host was very kind and responded quickly to all our queries, and the caretaker was also very nice and helpful. The place was clean, comfortable, and well maintained. The only thing to note is that it’s a bit far from the ghats, but apart from that, everything was excellent. Highly recommended!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/7ffdc928-fca1-4a2e-ac40-7c87e6ab97f2.jpeg?im_w=240",
    "name": "Vinit",
    "location": "Raipur, India"
  },
  {
    "id": "scraped-4",
    "quote": "Had a great stay! The place was clean and comfortable, and the host was friendly and responsive. Location was peaceful and convenient, would definitely recommend!”",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/b8c6c9ae-b4fb-4664-a1de-4edc7682a787.jpeg?im_w=240",
    "name": "Pooja",
    "location": "Bengaluru, India"
  },
  {
    "id": "scraped-5",
    "quote": "It was lovely staying at Karuna villa it was actually more beautiful from the picture now Karuna villa is our go to place every time we visit Kashi Thank you for the wonderful stay Preeti mam Saurabh Sir and Mangal bhaiya 🌸",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/accb3877-98b3-409b-a69c-ed5c786df352.jpeg?im_w=240",
    "name": "Anshika",
    "location": "India"
  },
  {
    "id": "scraped-6",
    "quote": "Absolutely loved my stay! ✨ The place was even more beautiful than the pictures (no filter needed , spotlessly clean and wonderfully cozy. Host Preeti and caretaker Mangal Bhaiya were super sweet and made sure everything was perfect — they even checked if I reached home safely!\n\nHighly recommend this place and will definitely stay here again whenever I’m in Varanasi. 💯",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/20f727da-9095-41c9-a586-51dcb79f3d11.jpeg?im_w=240",
    "name": "Girish",
    "location": "India"
  },
  {
    "id": "scraped-7",
    "quote": "It’s safe,Secure and clean",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/fb769bdc-59b1-4b58-9ebd-207be4f1d881.jpeg?im_w=240",
    "name": "Nitish",
    "location": "India"
  },
  {
    "id": "scraped-8",
    "quote": "Truly one of the best airbnb experiences that I’ve ever had. The place was clean, exactly matched the pictures (infact even more beautiful, ngl). The food was amazing and the host was truly welcoming and supportive. Felt like home.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/52c81974-8fb3-4b6a-b8b6-c622ed0a308f.jpeg?im_w=240",
    "name": "Akanksha",
    "location": "India"
  },
  {
    "id": "scraped-9",
    "quote": "\"Our stay was truly fantastic! The homestay is surrounded by beautiful greenery, creating a peaceful and refreshing environment. The house interior is well-designed, clean, and very comfortable. We had a wonderful experience and would highly recommend it to others.\"",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/9a6bd288-7e05-4bbd-a8db-cf5f465fd03f.jpeg?im_w=240",
    "name": "Pankaj",
    "location": "Angul, India"
  },
  {
    "id": "scraped-10",
    "quote": "Every detail is exactly how it is only the Air conditioning is not very fast and adequate for the room",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/790e3d1c-7ed6-4077-a719-e0453087ff6d.jpeg?im_w=240",
    "name": "Ankit",
    "location": "Pune, India"
  },
  {
    "id": "scraped-11",
    "quote": "My mom and brother had a great stay here! The 2-BHK place was exactly as described in the listing—clean, well-maintained, and fully equipped. The neighborhood was peaceful, and essential services like Zomato and Uber were easily available. The host was excellent with communication and made everything smooth and hassle-free.\n\nHappy to recommend this place to others!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/4b22666b-6062-4e57-89b6-589f614d7623.jpeg?im_w=240",
    "name": "Aditya",
    "location": "India"
  },
  {
    "id": "scraped-12",
    "quote": "Absolutely Loved the Stay!\nThe property is exactly as described—clean, beautiful, and very well-maintained. The ambiance was amazing, and the fragrance inside the rooms was a standout touch that made the experience even more pleasant.\n\nThe caretaker was extremely supportive and ensured everything went smoothly. Check-in was quick and hassle-free. This is exactly how an Airbnb property should be maintained—kudos to the host!\n\nAlso, if you're into clicking pictures or planning to change your display picture, this place offers some fantastic backdrops. Highly recommended!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/7d68f96b-d110-4072-bd48-52d37f563c44.jpeg?im_w=240",
    "name": "Vaibhav",
    "location": "India"
  },
  {
    "id": "scraped-13",
    "quote": "villa was super amazing, so quite and peaceful location.",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/3188833f-aa80-427b-b7de-03071ab0ddbf.jpeg?im_w=240",
    "name": "Aman",
    "location": "Siliguri, India"
  },
  {
    "id": "scraped-14",
    "quote": "Preeti was responsive to my queries. The caretaker Mangal was also quite co-operative. Overall a nice stay.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/ca483d36-f1be-49eb-8545-de4a9b650e09.jpeg?im_w=240",
    "name": "Shankar",
    "location": "Rourkela, India"
  },
  {
    "id": "scraped-15",
    "quote": "Ambience was good. Preeti as a host was very cooperative. Nice interior. Property was same as posted in pictures. Kitchen had all basic amenities from RO to induction to kettle. Mangal as a caretaker was very helpful , he also brought medicines for me as I requested and provided with whatever we wanted. Must book this property if you want a lavish and peaceful stay in Banaras. Kashi Vishvanath temple is also near to this property like 6-7 kms.Blinkit comes here easily.",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/3055635e-a452-429a-a40c-a2742de089d7.jpeg?im_w=240",
    "name": "Sugandha",
    "location": "India"
  },
  {
    "id": "scraped-16",
    "quote": "Care taker is good but plz maintenance kitchen just",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/eaab6f75-7144-4fba-9507-8a40d8d95c91.jpeg?im_w=240",
    "name": "Lavadiya",
    "location": "Rajkot, India"
  },
  {
    "id": "scraped-17",
    "quote": "In pictures stove was shown but later manager told us that its paid which was not mentioned anywhere..\n\nCare taker also was not helpful and late services provided.\nDidn’t liked at all. Would never visit again.\n\nAtleast mention which amenities are paid before so that guests plan accordingly.",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/User-457379998/original/b6ff2042-159c-4e3c-86e9-ddf2d940b015.jpeg?im_w=240",
    "name": "Akshit",
    "location": "Gurugram, India"
  },
  {
    "id": "scraped-18",
    "quote": "The host, manager and the caretaker all of them were very responsive and took care of all our requests, they also let us check out late given that there next guests were checking in late, in short quite accommodating and responsive! The location is a bit far from the main temples and tourist attractions, 45-60 mins of ride one way to the ghats!!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/3f3c0721-5bbc-49b8-8411-18fd1ea9970a.jpg?im_w=240",
    "name": "Lopamudra",
    "location": "Pune, India"
  },
  {
    "id": "scraped-19",
    "quote": "it needs a lot of maintainance",
    "rating": 2,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/65d7fb71-ae84-4e19-a60a-f5ddc2b20d92.jpeg?im_w=240",
    "name": "M",
    "location": "India"
  },
  {
    "id": "scraped-20",
    "quote": "It was really a great experience staying there & felt like home, I stayed there with my family and the place was very homely and full of good vibes the surrounding was so good and peaceful especially the balcony ,Vishal and Mangal bhaiya was very helpful already missing this place but will definitely go back there super soon ! Thanks again for everything we totally loved it.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/46b0e999-ecd6-4abf-aece-a5e326ba5fe8.jpeg?im_w=240",
    "name": "Vansh",
    "location": "India"
  },
  {
    "id": "scraped-21",
    "quote": "I had a great stay in Preeti's Airbnb. The location was perfect: close to main attractions yet in a quiet, peaceful area, making the place good for exploring as well as relaxing. Her house was clean and so well maintained; it contained everything I needed for my comfortable stay. The kitchen was fully equipped, the bed very comfortable, and there were even some nice touches like snacks and coffee that made me feel right at home. Preeti was a fantastic host-super responsive, always available to answer any questions, and made sure everything was perfect throughout my stay. It's clear she puts a lot of care into her place, and it really shows in every little detail. Hands down, this has been one of the best Airbnb experiences. If you're thinking about staying here, don't think twice-you won't regret it! I'm already looking forward to booking this place again next time I'm in the area. Highly recommended!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/73d764bd-97d0-4301-a411-c22840b5beda.jpeg?im_w=240",
    "name": "Prakhar Anand",
    "location": "Varanasi, India"
  },
  {
    "id": "scraped-22",
    "quote": "A great value for money. The host was responsive and contacted us before the stay. The place is as described in the pictures and the description.\nPerfect for a group of 4 with 2 large bedrooms.\nOne thing to note is that its far from the city (as rightly mentioned in the location) so significant (45mins each side) travelling is needed to get to major places.\nAlso, cleanliness can be improved. The sheets shared were not cleaned before use and we had to request to get it changed. Also, washrooms had major black fungus and were unclean.\nBut overall, 4/5 for the value for money",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/2e57e123-c22b-40aa-a684-73772c9f3074.jpg?im_w=240",
    "name": "Harshit",
    "location": "New Delhi, India"
  },
  {
    "id": "scraped-23",
    "quote": "This was my first trip to Banaras (Varanasi), and this property has been the best accommodation I've experienced so far. The check-in and check-out process was seamless. The ambiance was amazing, and I particularly enjoyed having access to the terrace.\n\nFor meals, they provide a menu with various food options you can order from. All major cultural and religious sites, including the Kashi Vishwanath Temple, are within a 10-12 km radius. Pro tip: Instead of booking cabs, use shared autos from the main road - they're much more economical.\n\nSpecial mention to Mangal Bhaiya, who takes care of the property. He's among the most humble and helpful people I've ever met.\n\nI highly recommend this property for anyone visiting Banaras!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/f04c2733-b1e8-44af-9458-3c933eb1cc85.jpeg?im_w=240",
    "name": "Adarsh",
    "location": "Patna, India"
  },
  {
    "id": "scraped-24",
    "quote": "excellent place\nexcellent behavior\n5 star rating",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/fea9cc35-13b0-4e67-adb8-b7ce06783816.jpeg?im_w=240",
    "name": "Rishu",
    "location": "India"
  },
  {
    "id": "scraped-25",
    "quote": "This property is beautiful decorated and well maintained by the Host.The surrounding are very peaceful.\nsituated conveniently near the Varanasi ring road.\nour family of 4 spent three days at this property which accurately matched the images provided .it features 2 bedroom\n(AC in one bedroom), a kitchen and one big bathroom with geyser.\nThe co- host is also very accommodating.\nThe caretaker is available to assist and provide any necessary support. This property is ideal for 3 to 4 individuals. parking available.\npros Excellent and reasonable Price\nCons it is located approximately 12- 13 from Kashi temple and Ghats.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/0c4fee16-8f8c-4e1c-8896-821492d8129d.jpeg?im_w=240",
    "name": "Dr Satyendra",
    "location": "Sagar, India"
  },
  {
    "id": "scraped-26",
    "quote": "Very good place to stay. Very neatly kept and felt very comfortable. Food provided was not tasty. Kitchen and bathroom were neatly maintained. Amenities kept at the bathroom were leftovers by other users. Washing soap and washing sink were not neatly kept.",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/User/original/15faed3e-8781-4cdf-ab95-b39af910004c.jpeg?im_w=240",
    "name": "Satheesh",
    "location": "Aluva, India"
  },
  {
    "id": "scraped-27",
    "quote": "It was a very beautiful 2 BHK flat with a large hall with very beautiful furniture. The cleanliness and service were also good. Overall a peaceful and beautiful place to stay during your visits.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User-571620788/original/dc2878a4-4448-4c98-b7d4-4b193a2c005b.jpeg?im_w=240",
    "name": "Mohit",
    "location": "India"
  },
  {
    "id": "scraped-28",
    "quote": "Home away from 🏡 home\nReally I mean it when I say this\nAll the things from exterior to interior ,service,responsiveness of the host were great.\nThe host Mrs. Preeti specially was always active and ready to help whenever needed.\nThe staff and caretaker are also ready to help.\nI don't think i could get such treatment at any of the hotel.\nMe along with my family had a great stay here 🙂\nWill surely stay whenever I come to varanasi again.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User-469730436/original/fc233ccc-14ad-41af-a351-5fd3c7839e89.jpeg?im_w=240",
    "name": "Keshav",
    "location": "Kurukshetra, India"
  },
  {
    "id": "scraped-29",
    "quote": "Great stay, Nice ambience, Quick check in, feels like home away from home.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User-587870536/original/c8dc841b-c8ed-4693-9dec-fc48e30f7da3.jpeg?im_w=240",
    "name": "Bhargav",
    "location": "India"
  },
  {
    "id": "scraped-30",
    "quote": "The host Ms Preeti was very responsive and helpful throughout . She arranged pick up from airport and allowed for late checkout as per our request. The flat is quite spacious, private and generally clean with most amenities provided. It is very close to the main road. It is a peaceful area surrounded by plants and trees. The property manager Mr Vishal was very helpful with everything we needed.",
    "rating": 4,
    "image": "https://a0.muscache.com/im/pictures/user/a5d91001-be95-4a49-96ec-43ccf2e3da33.jpg?im_w=240",
    "name": "Anitha",
    "location": "Sheffield, United Kingdom"
  },
  {
    "id": "scraped-31",
    "quote": "Place was good and easy reachable. Its around 18km from airport and it's a spacious 2bhk flat at 1st floor. Overall a nice stay.. Host was helpful and responsive.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/990f7fc4-6400-47ca-993c-a915f5261681.jpg?im_w=240",
    "name": "Rajat",
    "location": "India"
  },
  {
    "id": "scraped-32",
    "quote": "My stay at Karuna Villa was absolutely wonderful! The location is perfect, nestled in a quiet neighborhood yet close to all the major attractions. The house was spotlessly clean and beautifully decorated, making it feel like a home away from home. The amenities were top-notch, especially the fully equipped kitchen and cozy living area. The host was incredibly responsive and provided excellent recommendations for local dining and activities. I would highly recommend this property to anyone looking for a comfortable and enjoyable stay. I can't wait to return!",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/0b285bdf-42a5-42a2-a682-4b9144eb085b.jpg?im_w=240",
    "name": "Pradarsh",
    "location": "India"
  },
  {
    "id": "scraped-33",
    "quote": "We had the best stay,the host ,the manager everyone was so helpful.I would still come and stay here again if I’m ever given the chance to visit this beautiful city in the near future..Thank you #karunavilla",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User-585067365/original/6fa31ba4-277e-484f-bcfa-2af64c65a4b7.jpeg?im_w=240",
    "name": "Phungshokngam",
    "location": "India"
  },
  {
    "id": "scraped-34",
    "quote": "The property is located at a peaceful locality. It's a pretty place to stay in. The rooms were spacious and neatly maintained. The staff was responsive and flexible with the timings. Further the owner was really sweet and helped us get things which we needed in no time. overall an amazing stay.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/d8d18fb3-b666-4a23-8c11-9f4cc2267321.jpg?im_w=240",
    "name": "Arpit",
    "location": "India"
  },
  {
    "id": "scraped-35",
    "quote": "The place is located slightly away from the city hustle and provides a homely vibe. At the same time, the location of the property has connectivity from the National Highway and few kms away from Kashi Vishwanath temple and the main city, thereby adding an advantage to reach the property location without worrying about the city traffic.\n\nOur host, Preeti was very helpful and made sure of our comfortable stay. Alll our request was addressed by her and even the caretaker and the helper assigned by Preeti made sure that no stones were unturn in addressing any of our requests.\n\nThe stay was amazing and comfortable. I would highly recommend anyone planning to travel to Banaras to give Preeti and her staff to host your stay and enjoy your trip hassle-free.",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/User-492022762/original/fd7a0a3b-b5b7-4260-9d21-35cb8d3593c6.jpeg?im_w=240",
    "name": "Rajat",
    "location": "India"
  },
  {
    "id": "scraped-36",
    "quote": "the stay was awesome host was very very helpful enjoyed a lot",
    "rating": 5,
    "image": "https://a0.muscache.com/im/pictures/user/6c80a309-1b5f-4cc5-a4d8-002d73a2d999.jpg?im_w=240",
    "name": "Ankita",
    "location": "India"
  }
]